// Домашнее задание: 
// Задача 10: Напишите программу, которая принимает на вход трёхзначное 
// число и на выходе показывает вторую цифру этого числа.
// 456 -> 5 
// 782 -> 8 
// 918 -> 1

// Console.WriteLine("Введите трехзначное число: ");
// int a = int.Parse(Console.ReadLine());
// if ((a > 100)  & (a < 999))
// {
//     a = (a / 10) % 10;
//     Console.WriteLine(a);
// }
// else Console.WriteLine("Введенное число не верно");



// Задача 15: Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да 
// 7 -> да 
// 1 -> нет

// Console.WriteLine("Введите число ");
// int a = int.Parse(Console.ReadLine());
// if (a >= 1 & a <= 5)
// {
//     Console.WriteLine("не является день выходным");
// }
// else if (a >= 6 | a <= 7)
//     {
//         Console.WriteLine("является день выходным");
//     }

